monkeyboard/Wiegand-to-Serial-Converter-for-MonkeyBUS-PIC18/Firmware/main.c
/********************************************************************
 * Function:        GetFc (unsigned long code)
 *
 * PreCondition:    None
 *
 * Input:           Raw Wiegand code
 *
 * Output:          Facility code
 *
 * Side Effects:    None
 *
 * Overview:        Find facility code from 26 bit Wiegand
 *
 * Note:            None
 *******************************************************************/
unsigned long GetFc (unsigned long code)
{
	unsigned long fc;
	char i;

	fc = code & 0x3FFF000;
	fc = fc >> 17;
	if (fc % 2)
	{
		fc &= 0x1ff;
	}
	else
	{
		fc &= 0xff;
	}

	return fc;
}//end GetFc

void AddToPutBuff (char *data, char len)
{
	char i;
	for (i = 0; i < len; i ++)
	{
		RS232_Out_Data[LastRS232Out++] = data[i];
	}
}
/********************************************************************
 * Function:        void DoWiegandCoversion (void)
 *	
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        Converts Wiegand output into card number and
 *                  facility code.
 *
 * Note:            0x<Wiegand code> [facility code] <card ID>
 *******************************************************************/

void DoWiegandCoversion (void)
{
	char i;
	char hd [] = "0x";
	char l = 0;//strlen (hd);
	char *c;
	char sCount = 0;
	LastRS232Out = 0;
	if (((_bitCount) && (_sysTick - _lastWiegand) > 50))
	{
		//Make sure we get at least 26 bit Wiegand
		if (_bitCount > 25)
		{
			_gotCard = _cardTemp;
			//ignore the end bit
			_gotCard = _gotCard >> 1;
		}
		_cardTemp = 0;	
		_bitCount = 0;	
	}

	if (_gotCard)
	{
		mLED_4_Off();
//		RS232_Out_Data[sCount] = 'w';
//		sCount++;
//		RS232_Out_Data[sCount] = ' ';
//		sCount++;
		RS232_Out_Data[sCount] = '0';
		sCount++;
		RS232_Out_Data[sCount] = 'x';
		sCount++;
		cardId = GetCardId (_gotCard);
		fc = GetFc (_gotCard);		

		for (i = 0; i < MAXSIZE; i++)
		{
			buff[i] = 0;
		}

		for (i = 6; i > -1; i--)
		{
			l = ((_gotCard >> (i*4)) & 0x0f);
			l = HEXTOASCII ( l );
			RS232_Out_Data[sCount++] = l;
		}
		
		RS232_Out_Data[sCount] = ' ';
		sCount++;

		RS232_Out_Data[sCount] = '[';
		sCount++;
		
		itoa (fc, buff);
		strcpy (RS232_Out_Data+sCount, buff);
		sCount += strlen (buff);
		RS232_Out_Data[sCount] = ']';
		sCount++;
		RS232_Out_Data[sCount] = ' ';
		sCount++;
		ltoa (cardId, buff);
		strcpy (RS232_Out_Data+sCount, buff);
		sCount += strlen (buff);

		RS232_Out_Data_Rdy = 1;
		RS232cp = 0;

		RS232_Out_Data[sCount] = '\r';
		sCount++;
		RS232_Out_Data[sCount] = '\n';
		sCount++;
		LastRS232Out = sCount;
		_gotCard = 0;
	
	}
}//end DoWiegandCoversion

/********************************************************************
 * Function:        void ProcessIO(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function is a place holder for other user
 *                  routines. It is a mixture of both USB and
 *                  non-USB tasks.
 *
 * Note:            None
 *******************************************************************/
void ProcessIO(void)
{   
	DoWiegandCoversion ();
	
    //Blink the LEDs according to the USB device status
    //BlinkUSBStatus();
    // User Application USB tasks
    if((USBDeviceState < CONFIGURED_STATE)||(USBSuspendControl==1)) return;

	/*if (RS232_Out_Data_Rdy == 0)  // only check for new USB buffer if the old RS232 buffer is
	{						  // empty.  This will cause additional USB packets to be NAK'd
		LastRS232Out = getsUSBUSART(RS232_Out_Data,64); //until the buffer is free.
		if(LastRS232Out > 0)
		{	
			RS232_Out_Data_Rdy = 1;  // signal buffer full
			RS232cp = 0;  // Reset the current position
			mLED_2_On();
		}
	}*/

    //Check if one or more bytes are waiting in the physical UART transmit
    //queue.  If so, send it out the UART TX pin.
	if(RS232_Out_Data_Rdy && mTxRdyUSART())
	{

		// Change this part to send the data to Virtual Serial Port instead of real UART port
		putUSBUSART(&RS232_Out_Data[RS232cp],LastRS232Out);

		//putcUSART(RS232_Out_Data[RS232cp]);
		//++RS232cp;
		//if (RS232cp == LastRS232Out)
		RS232_Out_Data_Rdy = 0;
	}

    //Check if we received a character over the physical UART, and we need
    //to buffer it up for eventual transmission to the USB host.
	if(mDataRdyUSART() && (NextUSBOut < (CDC_DATA_OUT_EP_SIZE - 1)))
	{
		USB_Out_Buffer[NextUSBOut] = getcUSART();
		++NextUSBOut;
		USB_Out_Buffer[NextUSBOut] = 0;
	}

    //Check if any bytes are waiting in the queue to send to the USB host.
    //If any bytes are waiting, and the endpoint is available, prepare to
    //send the USB packet to the host.
	if((USBUSARTIsTxTrfReady()) && (NextUSBOut > 0))
	{
		putUSBUSART(&USB_Out_Buffer[0], NextUSBOut);
		NextUSBOut = 0;
	}

    CDCTxService();
}		//end ProcessIO

/********************************************************************
 * Function:        void BlinkUSBStatus(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        BlinkUSBStatus turns on and off LEDs 
 *                  corresponding to the USB device state.
 *
 * Note:            mLED macros can be found in HardwareProfile.h
 *                  USBDeviceState is declared and updated in
 *                  usb_device.c.
 *******************************************************************/
void BlinkUSBStatus(void)
{
    static WORD led_count=0;
    
    if(led_count == 0)led_count = 10000U;
    led_count--;

    #define mLED_Both_Off()         {mLED_1_Off();mLED_2_Off();}
    #define mLED_Both_On()          {mLED_1_On();mLED_2_On();}
    #define mLED_Only_1_On()        {mLED_1_On();mLED_2_Off();}
    #define mLED_Only_2_On()        {mLED_1_Off();mLED_2_On();}

    if(USBSuspendControl == 1)
    {
        if(led_count==0)
        {
            mLED_1_Toggle();
            if(mGetLED_1())
            {
                mLED_2_On();
            }
            else
            {
                mLED_2_Off();
            }
        }//end if
    }
    else
    {
        if(USBDeviceState == DETACHED_STATE)
        {
            mLED_Both_Off();
        }
        else if(USBDeviceState == ATTACHED_STATE)
        {
            mLED_Both_On();
        }
        else if(USBDeviceState == POWERED_STATE)
        {
            mLED_Only_1_On();
        }
        else if(USBDeviceState == DEFAULT_STATE)
        {
            mLED_Only_2_On();
        }
        else if(USBDeviceState == ADDRESS_STATE)
        {
            if(led_count == 0)
            {
                mLED_1_Toggle();
                mLED_2_Off();
            }//end if
        }
        else if(USBDeviceState == CONFIGURED_STATE)
        {
            if(led_count==0)
            {
                mLED_1_Toggle();
                if(mGetLED_1())
                {
                    mLED_2_Off();
                }
                else
                {
                    mLED_2_On();
                }
            }//end if
        }//end if(...)
    }//end if(UCONbits.SUSPND...)

